Revit 2027 API
MEPNetworkIterator.Next Method
 Moves this iterator to the next step of network iteration.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Next()
Public Sub Next
public:
void Next()
member Next : unit -> unit
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace